{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 50, 50, 3], "filters": 32, "dtype": "float32", "padding": "same", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "filters": 32, "dtype": "float32", "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "filters": 64, "dtype": "float32", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "filters": 64, "dtype": "float32", "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25, "dtype": "float32"}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "units": 1024, "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "name": "dense"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "units": 153, "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "name": "dense_2"}}]}}